siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT5_0 (number 48), MOTOR2_ONOFF_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_1 (number 49), MOTOR2_DIR_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
